<a href="https://colab.research.google.com/github/YashPatel1508/Pandas/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
df = pd.read_csv("/content/drive/MyDrive/Pandas CSV/pandas_practice_dataset_500_rows.csv") # Load CSV into pandas

In [2]:
df.head() #Show first 5 rows

,ID,Name,Age,Gender,City,Salary,Department,Experience_Years,Join_Date,Performance_Score,Bonus,Projects_Completed,Remote_Work,Training_Hours,Promoted
0,1,User_1,56,Male,Ahmedabad,76276,Finance,12.2,2018-01-01,1,3092,17,Yes,54,Yes
1,2,User_2,46,Male,Delhi,39541,Marketing,10.6,2018-01-02,1,19514,15,No,38,Yes
2,3,User_3,32,Male,Pune,114457,IT,18.4,2018-01-03,5,6242,7,Yes,67,No
3,4,User_4,60,Male,Ahmedabad,102310,IT,10.2,2018-01-04,4,9549,32,No,58,No
4,5,User_5,25,Male,Mumbai,64813,Sales,19.8,2018-01-05,3,6185,48,Yes,88,No

In [3]:
df.tail() #Show last 5 rows

,ID,Name,Age,Gender,City,Salary,Department,Experience_Years,Join_Date,Performance_Score,Bonus,Projects_Completed,Remote_Work,Training_Hours,Promoted
495,496,User_496,37,Male,Pune,143153,IT,5.2,2019-05-11,3,17311,6,Yes,3,Yes
496,497,User_497,41,Male,Mumbai,46589,Finance,3.3,2019-05-12,4,9566,27,Yes,62,Yes
497,498,User_498,29,Female,Mumbai,50015,Finance,7.3,2019-05-13,5,12889,8,No,67,No
498,499,User_499,52,Male,Ahmedabad,49009,Sales,9.3,2019-05-14,5,12254,27,No,80,Yes
499,500,User_500,50,Male,Mumbai,103309,HR,15.1,2019-05-15,2,12442,5,No,40,Yes

In [4]:
df.shape # Shape of dataset

(500, 15)

In [5]:
df.columns # Column names list

Index(['ID', 'Name', 'Age', 'Gender', 'City', 'Salary', 'Department',
       'Experience_Years', 'Join_Date', 'Performance_Score', 'Bonus',
       'Projects_Completed', 'Remote_Work', 'Training_Hours', 'Promoted'],
      dtype='object')

In [6]:
df.dtypes # Data types of all columns

ID                      int64
Name                   object
Age                     int64
Gender                 object
City                   object
Salary                  int64
Department             object
Experience_Years      float64
Join_Date              object
Performance_Score       int64
Bonus                   int64
Projects_Completed      int64
Remote_Work            object
Training_Hours          int64
Promoted               object
dtype: object

In [7]:
df.info() # Basic info summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  500 non-null    int64
 1   Name                500 non-null    object
 2   Age                 500 non-null    int64
 3   Gender              500 non-null    object
 4   City                500 non-null    object
 5   Salary              500 non-null    int64
 6   Department          500 non-null    object
 7   Experience_Years    500 non-null    float64
 8   Join_Date           500 non-null    object
 9   Performance_Score   500 non-null    int64
 10  Bonus               500 non-null    int64
 11  Projects_Completed  500 non-null    int64
 12  Remote_Work         500 non-null    object
 13  Training_Hours      500 non-null    int64
 14  Promoted            500 non-null    object
dtypes: float64(1), int64(7), object(7)
memory usage: 58.7+ KB

In [8]:
df.describe() # Statistical summary

,ID,Age,Salary,Experience_Years,Performance_Score,Bonus,Projects_Completed,Training_Hours
count,500.000000,500.000000,500.000000,500.000000,500.000000,500.000000,500.000000,500.000000
mean,250.500000,41.278000,85128.094000,10.301600,3.052000,10496.266000,24.814000,50.176000
std,144.481833,13.389072,37716.865083,5.656893,1.428768,5410.505013,14.860858,28.789907
min,1.000000,18.000000,20526.000000,0.600000,1.000000,1025.000000,0.000000,0.000000
25%,125.750000,30.000000,52358.750000,5.275000,2.000000,5945.750000,12.000000,24.750000
50%,250.500000,42.000000,84763.000000,10.400000,3.000000,10929.500000,25.000000,53.000000
75%,375.250000,52.000000,116538.750000,15.300000,4.000000,14846.500000,38.000000,75.000000
max,500.000000,64.000000,149972.000000,20.000000,5.000000,19990.000000,49.000000,99.000000

In [9]:
df["Age"] # select one coloum
df[["Age", "Salary"]] # select Multiple coloum

     Age  Salary
0     56   76276
1     46   39541
2     32  114457
3     60  102310
4     25   64813
..   ...     ...
495   37  143153
496   41   46589
497   29   50015
498   52   49009
499   50  103309

[500 rows x 2 columns]

In [10]:
len(df) #Count Rows

500

In [11]:
df["City"].unique() # Find Unique

array(['Ahmedabad', 'Delhi', 'Pune', 'Mumbai', 'Bangalore'], dtype=object)

In [12]:
df["Department"].nunique() # Count Unique

5

In [13]:
df["Department"].value_counts() # Count Value

Department
Sales        110
HR           109
IT           103
Marketing     98
Finance       80
Name: count, dtype: int64

In [16]:
df.sort_values("Salary", ascending=True) # Sort Value ascending

,ID,Name,Age,Gender,City,Salary,Department,Experience_Years,Join_Date,Performance_Score,Bonus,Projects_Completed,Remote_Work,Training_Hours,Promoted
467,468,User_468,43,Male,Bangalore,20526,Marketing,3.7,2019-04-13,1,18677,42,Yes,59,Yes
131,132,User_132,64,Male,Ahmedabad,20806,Marketing,14.9,2018-05-12,4,15823,6,No,79,Yes
319,320,User_320,44,Male,Ahmedabad,21007,Finance,16.9,2018-11-16,3,11195,36,Yes,75,No
329,330,User_330,36,Male,Bangalore,21435,Sales,14.7,2018-11-26,3,11593,39,Yes,93,No
248,249,User_249,57,Male,Pune,21591,IT,6.9,2018-09-06,5,11759,0,Yes,33,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
471,472,User_472,53,Male,Bangalore,149478,Sales,0.7,2019-04-17,3,15211,42,Yes,22,Yes
482,483,User_483,36,Male,Ahmedabad,149749,HR,14.3,2019-04-28,5,1999,7,Yes,14,Yes
36,37,User_37,20,Female,Pune,149828,Finance,1.0,2018-02-06,3,2589,22,No,37,No
265,266,User_266,18,Female,Delhi,149839,Marketing,2.3,2018-09-23,5,8186,6,Yes,88,No
113,114,User_114,24,Male,Pune,149972,Finance,19.1,2018-04-24,2,6355,25,No,72,Yes

In [17]:
df.sort_values("Salary", ascending=False) # Sort Value descending

,ID,Name,Age,Gender,City,Salary,Department,Experience_Years,Join_Date,Performance_Score,Bonus,Projects_Completed,Remote_Work,Training_Hours,Promoted
113,114,User_114,24,Male,Pune,149972,Finance,19.1,2018-04-24,2,6355,25,No,72,Yes
265,266,User_266,18,Female,Delhi,149839,Marketing,2.3,2018-09-23,5,8186,6,Yes,88,No
36,37,User_37,20,Female,Pune,149828,Finance,1.0,2018-02-06,3,2589,22,No,37,No
482,483,User_483,36,Male,Ahmedabad,149749,HR,14.3,2019-04-28,5,1999,7,Yes,14,Yes
471,472,User_472,53,Male,Bangalore,149478,Sales,0.7,2019-04-17,3,15211,42,Yes,22,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
248,249,User_249,57,Male,Pune,21591,IT,6.9,2018-09-06,5,11759,0,Yes,33,Yes
329,330,User_330,36,Male,Bangalore,21435,Sales,14.7,2018-11-26,3,11593,39,Yes,93,No
319,320,User_320,44,Male,Ahmedabad,21007,Finance,16.9,2018-11-16,3,11195,36,Yes,75,No
131,132,User_132,64,Male,Ahmedabad,20806,Marketing,14.9,2018-05-12,4,15823,6,No,79,Yes
467,468,User_468,43,Male,Bangalore,20526,Marketing,3.7,2019-04-13,1,18677,42,Yes,59,Yes

In [21]:
df.iloc[0] # Select first row

ID                             1
Name                      User_1
Age                           56
Gender                      Male
City                   Ahmedabad
Salary                     76276
Department               Finance
Experience_Years            12.2
Join_Date             2018-01-01
Performance_Score              1
Bonus                       3092
Projects_Completed            17
Remote_Work                  Yes
Training_Hours                54
Promoted                     Yes
Name: 0, dtype: object

In [22]:
df.iloc[5:11] # Select rows

,ID,Name,Age,Gender,City,Salary,Department,Experience_Years,Join_Date,Performance_Score,Bonus,Projects_Completed,Remote_Work,Training_Hours,Promoted
5,6,User_6,38,Female,Bangalore,57198,IT,17.1,2018-01-06,3,16271,11,Yes,95,No
6,7,User_7,56,Male,Ahmedabad,28820,Finance,4.6,2018-01-07,3,6776,10,Yes,61,Yes
7,8,User_8,36,Male,Ahmedabad,44070,Finance,18.6,2018-01-08,1,13449,4,Yes,12,No
8,9,User_9,40,Male,Delhi,89768,IT,2.8,2018-01-09,4,8823,26,No,80,Yes
9,10,User_10,28,Female,Pune,31122,IT,16.4,2018-01-10,5,16717,11,No,5,No
10,11,User_11,28,Female,Bangalore,100559,Sales,7.9,2018-01-11,2,8355,16,No,82,No

In [24]:
df["Bonus"].mean() # Mean

np.float64(10496.266)

In [29]:
df["Experience_Years"].max() # Max

20.0

In [30]:
df[(df["Salary"]>50000) & (df["City"]=="Ahmedabad")] # Where condition

,ID,Name,Age,Gender,City,Salary,Department,Experience_Years,Join_Date,Performance_Score,Bonus,Projects_Completed,Remote_Work,Training_Hours,Promoted
0,1,User_1,56,Male,Ahmedabad,76276,Finance,12.2,2018-01-01,1,3092,17,Yes,54,Yes
3,4,User_4,60,Male,Ahmedabad,102310,IT,10.2,2018-01-04,4,9549,32,No,58,No
26,27,User_27,39,Female,Ahmedabad,107312,Sales,18.5,2018-01-27,5,1436,46,Yes,91,Yes
30,31,User_31,59,Female,Ahmedabad,141826,HR,3.9,2018-01-31,1,16061,12,Yes,27,No
31,32,User_32,45,Female,Ahmedabad,55435,HR,10.3,2018-02-01,1,11576,19,No,2,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
481,482,User_482,27,Female,Ahmedabad,141787,Sales,11.0,2019-04-27,5,1389,35,No,17,No
482,483,User_483,36,Male,Ahmedabad,149749,HR,14.3,2019-04-28,5,1999,7,Yes,14,Yes
486,487,User_487,62,Male,Ahmedabad,120737,HR,9.5,2019-05-02,1,9125,44,No,73,Yes
488,489,User_489,33,Female,Ahmedabad,102503,HR,10.1,2019-05-04,3,3763,31,Yes,5,Yes
494,495,User_495,44,Male,Ahmedabad,146740,IT,2.5,2019-05-10,3,11758,28,Yes,95,No

In [31]:
df.groupby("Department")["Salary"].max() # Highest salary per department

Department
Finance      149972
HR           149749
IT           147706
Marketing    149839
Sales        149478
Name: Salary, dtype: int64

In [33]:
df["Annual_Salary"]=df["Salary"]*12 #Add new column Annual Salary

,ID,Name,Age,Gender,City,Salary,Department,Experience_Years,Join_Date,Performance_Score,Bonus,Projects_Completed,Remote_Work,Training_Hours,Promoted,Annual_Salary
0,1,User_1,56,Male,Ahmedabad,76276,Finance,12.2,2018-01-01,1,3092,17,Yes,54,Yes,915312
1,2,User_2,46,Male,Delhi,39541,Marketing,10.6,2018-01-02,1,19514,15,No,38,Yes,474492
2,3,User_3,32,Male,Pune,114457,IT,18.4,2018-01-03,5,6242,7,Yes,67,No,1373484
3,4,User_4,60,Male,Ahmedabad,102310,IT,10.2,2018-01-04,4,9549,32,No,58,No,1227720
4,5,User_5,25,Male,Mumbai,64813,Sales,19.8,2018-01-05,3,6185,48,Yes,88,No,777756
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
495,496,User_496,37,Male,Pune,143153,IT,5.2,2019-05-11,3,17311,6,Yes,3,Yes,1717836
496,497,User_497,41,Male,Mumbai,46589,Finance,3.3,2019-05-12,4,9566,27,Yes,62,Yes,559068
497,498,User_498,29,Female,Mumbai,50015,Finance,7.3,2019-05-13,5,12889,8,No,67,No,600180
498,499,User_499,52,Male,Ahmedabad,49009,Sales,9.3,2019-05-14,5,12254,27,No,80,Yes,588108
499,500,User_500,50,Male,Mumbai,103309,HR,15.1,2019-05-15,2,12442,5,No,40,Yes,1239708

In [37]:
df["Year"]=df["Join_Date"].dt.year
df

,ID,Name,Age,Gender,City,Salary,Department,Experience_Years,Join_Date,Performance_Score,Bonus,Projects_Completed,Remote_Work,Training_Hours,Promoted,Annual_Salary,Year
0,1,User_1,56,Male,Ahmedabad,76276,Finance,12.2,2018-01-01,1,3092,17,Yes,54,Yes,915312,2018
1,2,User_2,46,Male,Delhi,39541,Marketing,10.6,2018-01-02,1,19514,15,No,38,Yes,474492,2018
2,3,User_3,32,Male,Pune,114457,IT,18.4,2018-01-03,5,6242,7,Yes,67,No,1373484,2018
3,4,User_4,60,Male,Ahmedabad,102310,IT,10.2,2018-01-04,4,9549,32,No,58,No,1227720,2018
4,5,User_5,25,Male,Mumbai,64813,Sales,19.8,2018-01-05,3,6185,48,Yes,88,No,777756,2018
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
495,496,User_496,37,Male,Pune,143153,IT,5.2,2019-05-11,3,17311,6,Yes,3,Yes,1717836,2019
496,497,User_497,41,Male,Mumbai,46589,Finance,3.3,2019-05-12,4,9566,27,Yes,62,Yes,559068,2019
497,498,User_498,29,Female,Mumbai,50015,Finance,7.3,2019-05-13,5,12889,8,No,67,No,600180,2019
498,499,User_499,52,Male,Ahmedabad,49009,Sales,9.3,2019-05-14,5,12254,27,No,80,Yes,588108,2019
499,500,User_500,50,Male,Mumbai,103309,HR,15.1,2019-05-15,2,12442,5,No,40,Yes,1239708,2019

In [39]:
df.corr(numeric_only=True) #Correlation matrix

,ID,Age,Salary,Experience_Years,Performance_Score,Bonus,Projects_Completed,Training_Hours,Annual_Salary,Year
ID,1.000000,0.017480,0.008774,0.011774,0.029628,-0.048845,0.057185,-0.076286,0.008774,0.768962
Age,0.017480,1.000000,-0.049076,-0.022430,0.011185,-0.037045,-0.002942,0.000013,-0.049076,-0.007251
Salary,0.008774,-0.049076,1.000000,-0.040035,-0.056329,-0.004461,0.065154,-0.041411,1.000000,-0.029035
Experience_Years,0.011774,-0.022430,-0.040035,1.000000,0.032570,-0.038738,0.029976,-0.013671,-0.040035,0.030678
Performance_Score,0.029628,0.011185,-0.056329,0.032570,1.000000,0.028538,-0.057495,0.049373,-0.056329,0.009405
Bonus,-0.048845,-0.037045,-0.004461,-0.038738,0.028538,1.000000,0.047052,-0.023431,-0.004461,-0.055868
Projects_Completed,0.057185,-0.002942,0.065154,0.029976,-0.057495,0.047052,1.000000,0.021023,0.065154,-0.003304
Training_Hours,-0.076286,0.000013,-0.041411,-0.013671,0.049373,-0.023431,0.021023,1.000000,-0.041411,-0.106316
Annual_Salary,0.008774,-0.049076,1.000000,-0.040035,-0.056329,-0.004461,0.065154,-0.041411,1.000000,-0.029035
Year,0.768962,-0.007251,-0.029035,0.030678,0.009405,-0.055868,-0.003304,-0.106316,-0.029035,1.000000